print(f"Кел чогуу оюн ойнойбуз. \nДаярсынбы? \nАнда шартттарын жакшылап окуу! \nБул оюн чын же жалган деген оюн")
print(f"Сен ч(чын), ж(жалган) деп жооп бер \nАнда баштадык")
point = 0
a = input("1) 1811-жылы 16-декабрда күчтүү жер титирөө болуп, Миссисипи дарыясынын суулары тескери агып кеткен. ")
if a=="ч":
    point += 5
    print('Азаматсыз жооп туура')
elif a=="ж":
    print("Жакшы окуш керек эле")
else:
    print("Мен сага ч же ж деп жооп бер деп айттымго!")

b = input("2) Дүйнөдөгү эң эски лампочка Калифорниянын Ливермор өрт өчүрүүчү жайында табылган. Ал 115 жылдан ашуун убакыттан бери иштеп келе жатат жана дагы деле өчүрүлө элек. ")
if b=="ч":
    point += 5
    print('Азаматсыз жооп туура')
elif b=="ж":
    print("Жакшы окуш керек эле")
else:
    print("Мен сага ч же ж деп жооп бер деп айттымго!")

c = input("3) Дүйнөдөгү эң терең почта ящиги Япониянын Сусами булуңунда жайгашкан. Тактап айтканда, суу астында 9 метр. ")
if c=="ч":
    print('Маани берип окуй журунуз')
elif c=="ж":
    point += 5
    print("Азаматсыз жооп туура'")
else:
    print("Мен сага ч же ж деп жооп бер деп айттымго!")

d = input("4) Адамдар компьютердин бетиндеги жазууларды барактагы текстке салыштырмалуу 25 % жай окуйт. ")
if d=="ч":
    point += 5
    print('Азаматсыз жооп туура')
elif d=="ж":
    print("Жакшы окуш керек эле")
else:
    print("Мен сага ч же ж деп жооп бер деп айттымго!")

f = input("5) Ар бир кирпик 9 ай гана жашайт. ")
if f=="ч":
    print('Капаланбаныз')
elif f=="ж":
    point += 5
    print("Азаматсыз жооп туура")
else:
    print("Мен сага ч же ж деп жооп бер деп айттымго!")

v = input("6) Эгерде адамдын көзү санариптик  фотоаппарат болсо 576 мегапиксель болот. ")
if v=="ч":
    point += 5
    print('Азаматсыз жооп туура')
elif v=="ж":
    print("Жакшы окуш керек эле")
else:
    print("Мен сага ч же ж деп жооп бер деп айттымго!")

g = input("7) Күн жараткан шамаалдын ылдамдыгы секундасына болжол менен 451 километрди түзөт. ")
if g=="ч":
    print('Дагы бир жолу аракет кылып корунуз')
elif g=="ж":
    point += 5
    print("Азаматсыз жооп туура")
else:
    print("Мен сага ч же ж деп жооп бер деп айттымго!")

print(f"Сиздин топтогон балыныз: {point}")

